// метод итерации по объектам

/*
for (var key in obj) {
  console.log(key[obj]);
}
*/

// .push():lendth - добавляет елемент в конец массива, возвращает длинну массива

// .pop():element - вырезает элемент с конца массива, и возвращает этот же элемент

// .unshift():lendth - добавляет елемент в начало массива (сдвигает всех дальше), возвращает длинну массива

// .shift():element - вырезает элемент с начала массива (сдвигает всех вперед), и возвращает этот же элемент

// slice.(arg1, arg2):newArr - копирует часть массива или весь массив, если без аргументов, возвращает копию.
// arg1 - с какого элемента включительно
// arg2 - по какой объект НЕ включительно

// Замыкание

/*
function showBigger(n) {
  return function frozzen(m) {
    return n < m;
  }
}
*/

/////////////////////////////////////////////////////////
































